In [10]:
!python --version

!pip install -i https://test.pypi.org/simple/ --upgrade lambdata-temsychen

Python 3.6.9
Looking in indexes: https://test.pypi.org/simple/
Requirement already up-to-date: lambdata-temsychen in /usr/local/lib/python3.6/dist-packages (0.0.2)
Requirement already satisfied, skipping upgrade: numpy in /usr/local/lib/python3.6/dist-packages (from lambdata-temsychen) (1.19.5)
Requirement already satisfied, skipping upgrade: pandas in /usr/local/lib/python3.6/dist-packages (from lambdata-temsychen) (1.1.5)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.7.3 in /usr/local/lib/python3.6/dist-packages (from pandas->lambdata-temsychen) (2.8.1)
Requirement already satisfied, skipping upgrade: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->lambdata-temsychen) (2018.9)
Requirement already satisfied, skipping upgrade: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.7.3->pandas->lambdata-temsychen) (1.15.0)

In [11]:
from lambdata_temsychen.helper_functions import null_count, randomize, train_split
import pandas as pd
from numpy import NaN

In [26]:
df = pd.DataFrame({'col0':[16, 34, 15, NaN],'col1':[NaN, NaN, 23, 8], 'col2':[11, 27, 99, NaN]})

null_count(df)

4

In [27]:
df

   col0  col1  col2
0  16.0   NaN  11.0
1  34.0   NaN  27.0
2  15.0  23.0  99.0
3   NaN   8.0   NaN

In [28]:
randomize(df, 37)

   col0  col1  col2
2  15.0  23.0  99.0
1  34.0   NaN  27.0
0  16.0   NaN  11.0
3   NaN   8.0   NaN

In [22]:
df = pd.read_csv(
        "https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data")

print('Train test split:\n', train_split(df, .8))

Train test split:
 (       39   State-gov   77516      Bachelors  ...   0  40   United-States   <=50K
12464  49     Private  140121        HS-grad  ...   0  50   United-States   <=50K
18438  57     Private  158827        HS-grad  ...   0  40   United-States   <=50K
31038  17     Private  160049           10th  ...   0  12   United-States   <=50K
2608   45   State-gov  102308   Some-college  ...   0  40   United-States   <=50K
28656  46     Private  465974           11th  ...   0  30   United-States   <=50K
...    ..         ...     ...            ...  ...  ..  ..             ...     ...
988    51     Private  122159   Some-college  ...   0  40   United-States   <=50K
30971  21     Private  211391   Some-college  ...   0  27   United-States   <=50K
9036   22     Private  161532   Some-college  ...   0  35   United-States   <=50K
20843  50     Private  108446   Some-college  ...   0  40   United-States   <=50K
1935   38   Local-gov  255454      Bachelors  ...   0  40   United-States   <=50K

[26048 rows x 15 columns],        39          State-gov   77516  ...  40   United-States   <=50K
23751  36          State-gov  183735  ...  40   United-States    >50K
22267  69            Private  125437  ...  32   United-States   <=50K
27695  26            Private  177147  ...  40   United-States   <=50K
6451   26            Private  159732  ...  52   United-States   <=50K
24698  52   Self-emp-not-inc  174752  ...  40   United-States   <=50K
...    ..                ...     ...  ...  ..             ...     ...
10450  18            Private  312353  ...  20   United-States   <=50K
3714   21            Private  344891  ...  20   United-States   <=50K
12323  46            Private  132912  ...  45   United-States    >50K
10481  42       Self-emp-inc  130126  ...  40   United-States    >50K
31163  49            Private   34545  ...  40   United-States    >50K

[6512 rows x 15 columns])